app/controllers/courses_controller.rb

INSERT INTO "courses" ("course_code", "course_name", "cee_marks", "see_marks", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["course_code", "18cs111"], ["course_name", "oops"], ["cee_marks", 40], ["see_marks", 60], ["created_at", "2022-05-04 14:26:58.151125"], ["updated_at", "2022-05-04 14:26:58.151125"]]
---
  def create
    @course = Course.new(course_params)

    respond_to do |format|
      if @course.save