app/controllers/results_controller.rb

SELECT "students".* FROM "students" WHERE (lower(usn) LIKE '%%')
SELECT "students".* FROM "students" WHERE (lower(usn) LIKE '%18cs02%')
SELECT "results".* FROM "results" WHERE (student_id = [])
SELECT "results".* FROM "results" WHERE "results"."student_id" IN ($1, $2)  [["student_id", 1], ["student_id", 2]]
SELECT "courses".* FROM "courses" WHERE "courses"."id" IN ($1, $2, $3, $4)  [["id", 1], ["id", 2], ["id", 1], ["id", 2]]
---
    def result
      #@results=Result.search(params[:search])

        @usn_id=params[:search]
        @learners=Student.all.where("lower(usn) LIKE :search",search: "%#{@usn_id}%")
        @ids= []

        @learners.each do |learner|
          #@ids <<learner.id#1,2..
          @ids <<learner.id
        end
       # @marks=Result.all.where("student_id in #{@ids}")
       @marks=Result.where(student_id: @ids)
       @courseids=@marks.map(&:course_id)
        #@marks.each do |mark|
         #  @courseids=mark.course_id
        #end
           @subs=Course.all.where(id: @courseids)